cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
            <register>
               <name>SUSP2R</name>
               <displayName>SUSP2R</displayName>
               <description>AES suspend register 2</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP2R</name>
                     <description>AES suspend register 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP3R</name>
               <displayName>SUSP3R</displayName>
               <description>AES suspend register 3</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP3R</name>
                     <description>AES suspend register 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP4R</name>
               <displayName>SUSP4R</displayName>
               <description>AES suspend register 4</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP4R</name>
                     <description>AES suspend register 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP5R</name>
               <displayName>SUSP5R</displayName>
               <description>AES suspend register 5</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP5R</name>
                     <description>AES suspend register 5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP6R</name>
               <displayName>SUSP6R</displayName>
               <description>AES suspend register 6</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP6R</name>
                     <description>AES suspend register 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP7R</name>
               <displayName>SUSP7R</displayName>
               <description>AES suspend register 7</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP7R</name>
                     <description>AES suspend register 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral> 
      <peripheral>
         <name>COMP</name>
         <description>Comparator</description>
         <groupName>COMP</groupName>
         <baseAddress>0x40010200</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>COMP</name>
            <description>COMP2 and COMP1 interrupt
        through EXTI[22:21]</description>
            <value>21</value>
         </interrupt>
         <registers>
            <register>
               <name>COMP1_CSR</name>
               <displayName>COMP1_CSR</displayName>
               <description>COMP1_CSR</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>COMP1_CSR register lock               bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>Comparator 1 output status               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INMESEL</name>
                     <description>comparator 1 input minus extended               selection bits.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>Voltage scaler enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>Scaler bridge enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKING</name>
                     <description>Comparator 1 blanking source selection               bits</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>Comparator 1 hysteresis selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POLARITY</name>
                     <description>Comparator 1 polarity selection               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>Comparator1 input plus selection               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>Comparator 1 input minus selection               bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PWRMODE</name>
                     <description>Power Mode of the comparator               1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Comparator 1 enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP2_CSR</name>
               <displayName>COMP2_CSR</displayName>
               <description>COMP2_CSR</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>CSR register lock bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>Comparator 2 output status               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INMESEL</name>
                     <description>comparator 2 input minus extended               selection bits.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>Voltage scaler enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>Scaler bridge enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKING</name>
                     <description>Comparator 2 blanking source selection               bits</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>Comparator 2 hysteresis selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POLARITY</name>
                     <description>Comparator 2 polarity selection               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WINMODE</name>
                     <description>Windows mode selection bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>Comparator 1 input plus selection               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>Comparator 2 input minus selection               bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PWRMODE</name>
                     <description>Power Mode of the comparator               2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Comparator 2 enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
