cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DMA1">
         <name>DMA2</name>
         <baseAddress>0x40020400</baseAddress>
         <interrupt>
            <name>DMA2_CH1</name>
            <description>DMA2 channel 1 non-secure interrupt</description>
            <value>54</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH2</name>
            <description>DMA2 channel 2 non-secure interrupt</description>
            <value>55</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH3</name>
            <description>DMA2 channel 3 non-secure interrupt</description>
            <value>56</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH4</name>
            <description>DMA2 channel 4 non-secure interrupt</description>
            <value>57</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH5</name>
            <description>DMA2 channel 5 non-secure interrupt</description>
            <value>58</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH6</name>
            <description>DMA2 channel 6 non-secure interrupt</description>
            <value>59</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH7</name>
            <description>DMA2 channel 7 non-secure interrupt</description>
            <value>60</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>DMAMUX</name>
         <description>DMA request multiplexer</description>
         <groupName>DMAMUX</groupName>
         <baseAddress>0x40020800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMAMUX1_OVR</name>
            <description>DMAMUX1 overrun interrupt</description>
            <value>61</value>
         </interrupt>
         <registers>
            <register>
               <name>C0CR</name>
               <displayName>C0CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1CR</name>
               <displayName>C1CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2CR</name>
               <displayName>C2CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C3CR</name>
               <displayName>C3CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C4CR</name>
               <displayName>C4CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C5CR</name>
               <displayName>C5CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C6CR</name>
               <displayName>C6CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C7CR</name>
               <displayName>C7CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C8CR</name>
               <displayName>C8CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
