cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
            <register>
               <name>C9CR</name>
               <displayName>C9CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C10CR</name>
               <displayName>C10CR</displayName>
               <description>C10CR</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>NBREQ</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>SPOL</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>SE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>EGE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>SOIE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMAREQ_ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C11CR</name>
               <displayName>C11CR</displayName>
               <description>C11CR</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>NBREQ</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>SPOL</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>SE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>EGE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>SOIE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMAREQ_ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C12CR</name>
               <displayName>C12CR</displayName>
               <description>C12CR</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>NBREQ</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>SPOL</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>SE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>EGE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>SOIE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMAREQ_ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C13CR</name>
               <displayName>C13CR</displayName>
               <description>C13CR</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>NBREQ</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>SPOL</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>SE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>EGE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>SOIE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMAREQ_ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>request line multiplexer interrupt channel           status register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOF13</name>
                     <description>Synchronization overrun event               flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF12</name>
                     <description>SOF12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF11</name>
                     <description>SOF11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF10</name>
                     <description>SOF10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF9</name>
                     <description>SOF9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF8</name>
                     <description>SOF8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF7</name>
                     <description>SOF7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF6</name>
                     <description>SOF6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF5</name>
                     <description>SOF5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF4</name>
                     <description>SOF4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF3</name>
                     <description>SOF3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF2</name>
                     <description>SOF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF1</name>
                     <description>SOF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF0</name>
                     <description>SOF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFR</name>
               <displayName>CCFR</displayName>
               <description>request line multiplexer interrupt channel           clear flag register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSOF13</name>
                     <description>CSOF13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF12</name>
                     <description>CSOF12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF11</name>
                     <description>CSOF11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF10</name>
                     <description>CSOF10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF9</name>
                     <description>CSOF9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF8</name>
                     <description>CSOF8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF7</name>
                     <description>CSOF7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF6</name>
                     <description>CSOF6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF5</name>
                     <description>CSOF5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF4</name>
                     <description>CSOF4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF3</name>
                     <description>CSOF3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF2</name>
                     <description>CSOF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF1</name>
                     <description>CSOF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF0</name>
                     <description>CSOF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG0CR</name>
               <displayName>RG0CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG1CR</name>
               <displayName>RG1CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
