cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
            <register>
               <name>RG2CR</name>
               <displayName>RG2CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG3CR</name>
               <displayName>RG3CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RGSR</name>
               <displayName>RGSR</displayName>
               <description>request generator interrupt status           register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OF3</name>
                     <description>Trigger overrun event flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OF2</name>
                     <description>OF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OF1</name>
                     <description>OF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OF0</name>
                     <description>OF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RGCFR</name>
               <displayName>RGCFR</displayName>
               <description>request generator interrupt clear flag           register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COF3</name>
                     <description>Clear trigger overrun event               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COF2</name>
                     <description>COF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COF1</name>
                     <description>COF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COF0</name>
                     <description>COF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>                                 
