cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EXTI</name>
         <description>External interrupt/event       controller</description>
         <groupName>EXTI</groupName>
         <baseAddress>0x58000800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PVD_PVM_3</name>
            <description>PVD through EXTI[16],
             PVM[3] through EXTI[34]</description>
            <value>1</value>
         </interrupt>
         <interrupt>
            <name>EXTI0</name>
            <description>EXTI line 0 interrupt through
        EXTI</description>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>EXTI1</name>
            <description>EXTI line 1 interrupt through
        EXTI</description>
            <value>7</value>
         </interrupt>
         <interrupt>
            <name>EXTI2</name>
            <description>EXTI line 2 interrupt through
        EXTI</description>
            <value>8</value>
         </interrupt>
         <interrupt>
            <name>EXTI3</name>
            <description>EXTI line 3 interrupt through
        EXTI</description>
            <value>9</value>
         </interrupt>
         <interrupt>
            <name>EXTI4</name>
            <description>EXTI line 4 interrupt through
        EXTI</description>
            <value>10</value>
         </interrupt>
         <interrupt>
            <name>EXTI9_5</name>
            <description>EXTI line 9_5 interrupt through
        EXTI</description>
            <value>22</value>
         </interrupt>
         <interrupt>
            <name>EXTI15_10</name>
            <description>EXTI line 15_10] interrupt through
        EXTI</description>
            <value>41</value>
         </interrupt>
         <interrupt>
            <name>Radio_IRQ_Busy</name>
            <description>Radio IRQs, RFBUSY interrupt through
        EXTI</description>
            <value>50</value>
         </interrupt>
         <registers>
            <register>
               <name>RTSR1</name>
               <displayName>RTSR1</displayName>
               <description>rising trigger selection           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RT</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>RT21</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTSR1</name>
               <displayName>FTSR1</displayName>
               <description>falling trigger selection           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FT</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>FT21</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWIER1</name>
               <displayName>SWIER1</displayName>
               <description>software interrupt event           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>SWI21</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR1</name>
               <displayName>PR1</displayName>
               <description>EXTI pending register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIF</name>
                     <description>Configurable event inputs Pending               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>PIF21</name>
                     <description>Configurable event inputs Pending               bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTSR2</name>
               <displayName>RTSR2</displayName>
               <description>rising trigger selection           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RT34</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                
                  <field>
                     <name>RT45</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTSR2</name>
               <displayName>FTSR2</displayName>
               <description>falling trigger selection           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FT34</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FT45</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWIER2</name>
               <displayName>SWIER2</displayName>
               <description>software interrupt event           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI34</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWI45</name>
                     <description>Software interrupt on event               45</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR2</name>
               <displayName>PR2</displayName>
               <description>pending register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIF34</name>
                     <description>Configurable event inputs 33 Pending               bit.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIF45</name>
                     <description>Configurable event inputs 45 Pending               bit.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR1</name>
               <displayName>IMR1</displayName>
               <description>interrupt mask register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>wakeup with interrupt Mask on event input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMR1</name>
               <displayName>EMR1</displayName>
               <description>event mask register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
			   <fields>
				<field>
				  <name>EM0</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM1</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM2</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM3</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM4</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM5</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM6</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM7</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM8</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM9</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM10</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM11</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM12</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM13</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM14</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM15</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM17</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM18</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM19</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM20</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM21</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>EM22</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>            
               </fields>
            </register>
            <register>
               <name>IMR2</name>
               <displayName>IMR2</displayName>
               <description>interrupt mask           register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IM34</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>IM38</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>IM42</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>    
