cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSEM</name>
         <description>Hardware semaphore</description>
         <groupName>HSEM</groupName>
         <baseAddress>0x58001400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSEM</name>
            <description>Semaphore interrupt 0 to CPU</description>
            <value>47</value>
         </interrupt>
         <registers>
            <register>
               <name>HSEM_R0</name>
               <displayName>HSEM_R0</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R1</name>
               <displayName>HSEM_R1</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R2</name>
               <displayName>HSEM_R2</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R3</name>
               <displayName>HSEM_R3</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R4</name>
               <displayName>HSEM_R4</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R5</name>
               <displayName>HSEM_R5</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R6</name>
               <displayName>HSEM_R6</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R7</name>
               <displayName>HSEM_R7</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R8</name>
               <displayName>HSEM_R8</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R9</name>
               <displayName>HSEM_R9</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R10</name>
               <displayName>HSEM_R10</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R11</name>
               <displayName>HSEM_R11</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R12</name>
               <displayName>HSEM_R12</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R13</name>
               <displayName>HSEM_R13</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R14</name>
               <displayName>HSEM_R14</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_R15</name>
               <displayName>HSEM_R15</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_RLR0</name>
               <displayName>HSEM_RLR0</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_RLR1</name>
               <displayName>HSEM_RLR1</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_RLR2</name>
               <displayName>HSEM_RLR2</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MASTERID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
