cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
            <register>
               <name>HSEM_ICR</name>
               <displayName>HSEM_ICR</displayName>
               <description>HSEM Interrupt clear register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISC0</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC1</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC2</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC3</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC4</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC5</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC6</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC7</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC8</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC9</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC10</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC11</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC12</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC13</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC14</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISC15</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>			          		   
            <register>
               <name>HSEM_ISR</name>
               <displayName>HSEM_ISR</displayName>
               <description>HSEM Interrupt status register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISF0</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF1</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF2</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF3</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF4</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF5</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF6</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF7</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF8</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF9</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF10</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF11</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF12</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF13</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF14</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISF15</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>		         
            <register>
               <name>HSEM_MISR</name>
               <displayName>HSEM_MISR</displayName>
               <description>HSEM Masked interrupt status           register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MISF0</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF1</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF2</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF3</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF4</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF5</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF6</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF7</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF8</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF9</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF10</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF11</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF12</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF13</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF14</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISF15</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>		        
            <register>
               <name>HSEM_CR</name>
               <displayName>HSEM_CR</displayName>
               <description>HSEM Clear register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASTERID</name>
                     <description>MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Semaphore clear Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSEM_KEYR</name>
               <displayName>HSEM_KEYR</displayName>
               <description>HSEM Interrupt clear register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Semaphore Clear Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>						               
