cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
            <register>
               <name>IPR11</name>
               <displayName>IPR11</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x32C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR12</name>
               <displayName>IPR12</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x330</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR13</name>
               <displayName>IPR13</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x334</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR14</name>
               <displayName>IPR14</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x338</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR15</name>
               <displayName>IPR15</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x33C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR16</name>
               <displayName>IPR16</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x340</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR17</name>
               <displayName>IPR17</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x344</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
