cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC_STIR</name>
         <description>Nested vectored interrupt       controller</description>
         <groupName>NVIC</groupName>
         <baseAddress>0xE000EF00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STIR</name>
               <displayName>STIR</displayName>
               <description>Software trigger interrupt           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Software generated interrupt               ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PKA</name>
         <description>Public key accelerator</description>
         <groupName>PKA</groupName>
         <baseAddress>0x58002000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x2000</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PKA</name>
            <description>Private key accelerator
        interrupt</description>
            <value>53</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRIE</name>
                     <description>Address error interrupt               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMERRIE</name>
                     <description>RAM error interrupt enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROCENDIE</name>
                     <description>PROCENDIE</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>PKA operation code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>start the operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>PKA enable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRF</name>
                     <description>Address error flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMERRF</name>
                     <description>PKA RAM error flag</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROCENDF</name>
                     <description>PKA End of Operation flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>PKA operation is in progressThis bit is               set to 1 whenever START bit in the PKA_CR is set. It               is automatically cleared when the computation is               complete, meaning that PKA RAM can be safely accessed               and a new operation can be started.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRFR</name>
               <displayName>CLRFR</displayName>
               <description>clear flag register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRFC</name>
                     <description>Clear Address error flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMERRFC</name>
                     <description>Clear PKA RAM error flag</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROCENDFC</name>
                     <description>Clear PKA End of Operation               flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                		
               </fields>
            </register>
