cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral>
          <name>RTC</name>
          <description>Real-time clock</description>
          <groupName>RTC</groupName>
          <baseAddress>0x40002800</baseAddress>
          <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
          </addressBlock>
          <interrupt>
            <name>TAMP_RTCSTAMP_LSECSS_RTCSSRU</name>
            <description>Tamper, TimeStamp, LSECSS,RTC_SSRU interrupt</description>
            <value>2</value>
          </interrupt>
		  <interrupt>
			<name>RTC_WKUP</name>
			<description>RTC wakeup interrupt</description>
			<value>3</value>
		  </interrupt>
		  <interrupt>
			<name>RTC_ALARM</name>
			<description>RTC alarms A and B interrupt</description>
			<value>42</value>
		  </interrupt>
		  <registers>
			<register>
			  <name>TR</name>
			  <displayName>TR</displayName>
			  <description>TR</description>
			  <addressOffset>0x0</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>DR</name>
			  <displayName>DR</displayName>
			  <description>DR</description>
			  <addressOffset>0x4</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00002101</resetValue>
			  <fields>
				<field>
				  <name>YT</name>
				  <description>Year tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>YU</name>
				  <description>Year units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>WDU</name>
				  <description>Week day units</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MT</name>
				  <description>Month tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MU</name>
				  <description>Month units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>DU</name>
				  <description>Date units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>SSR</name>
			  <displayName>SSR</displayName>
			  <description>SSR</description>
			  <addressOffset>0x8</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Synchronous binary counter</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ICSR</name>
			  <displayName>ICSR</displayName>
			  <description>ICSR</description>
			  <addressOffset>0xC</addressOffset>
			  <size>0x20</size>
			  <resetValue>0x00000007</resetValue>
			   <fields>
					  <field>
						 <name>RECALPF</name>
						 <description>Recalibration pending Flag</description>
						 <bitOffset>16</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  </field>
					  <field>
						 <name>BCDU</name>
						 <description>BCD update</description>
						 <bitOffset>10</bitOffset>
						 <bitWidth>3</bitWidth>
						 <access>read-write</access>
					  </field>
					  <field>
						 <name>BIN</name>
						 <description>Binary mode</description>
						 <bitOffset>8</bitOffset>
						 <bitWidth>2</bitWidth>
						 <access>read-write</access>
					  </field> 
					  <field>
						 <name>INIT</name>
						 <description>Initialization mode</description>
						 <bitOffset>7</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-write</access>
					  </field>
					  <field>
						 <name>INITF</name>
						 <description>Initialization flag</description>
						 <bitOffset>6</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  </field>
					  <field>
						 <name>RSF</name>
						 <description>Registers synchronization               flag</description>
						 <bitOffset>5</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-write</access>
					  </field>
					  <field>
						 <name>INITS</name>
						 <description>Initialization status flag</description>
						 <bitOffset>4</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  </field>
					  <field>
						 <name>SHPF</name>
						 <description>Shift operation pending</description>
						 <bitOffset>3</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  </field>
					  <field>
						 <name>WUTWF</name>
						 <description>Wakeup timer write flag</description>
						 <bitOffset>2</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  </field>                               
				   </fields>
			</register>
			<register>
			  <name>PRER</name>
			  <displayName>PRER</displayName>
			  <description>PRER</description>
			  <addressOffset>0x10</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x007F00FF</resetValue>
			  <fields>
				<field>
				  <name>PREDIV_A</name>
				  <description>Asynchronous prescaler               factor</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>7</bitWidth>
				</field>
				<field>
				  <name>PREDIV_S</name>
				  <description>Synchronous prescaler               factor</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>WUTR</name>
			  <displayName>WUTR</displayName>
			  <description>WUTR</description>
			  <addressOffset>0x14</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x0000FFFF</resetValue>
			  <fields>
				<field>
				  <name>WUTOCLR</name>
				  <description>Wakeup auto-reload output clear value</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>16</bitWidth>
				</field>
				<field>
				  <name>WUT</name>
				  <description>Wakeup auto-reload value               bits</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>CR</name>
			  <displayName>CR</displayName>
			  <description>CR</description>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>OUT2EN</name>
				  <description>RTC_OUT2 output enable</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TAMPALRM_TYPE</name>
				  <description>TAMPALRM output type</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TAMPALRM_PU</name>
				  <description>TAMPALRM pull-up enable</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TAMPOE</name>
				  <description>Tamper detection output enable on               TAMPALRM</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TAMPTS</name>
				  <description>Activate timestamp on tamper detection               event</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ITSE</name>
				  <description>timestamp on internal event               enable</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COE</name>
				  <description>Calibration output enable</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OSEL</name>
				  <description>Output selection</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>POL</name>
				  <description>Output polarity</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COSEL</name>
				  <description>Calibration output               selection</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>BKP</name>
				  <description>Backup</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SUB1H</name>
				  <description>Subtract 1 hour (winter time               change)</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>ADD1H</name>
				  <description>Add 1 hour (summer time               change)</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>TSIE</name>
				  <description>Timestamp interrupt enable</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUTIE</name>
				  <description>Wakeup timer interrupt               enable</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ALRBIE</name>
				  <description>Alarm B interrupt enable</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ALRAIE</name>
				  <description>Alarm A interrupt enable</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TSE</name>
				  <description>timestamp enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUTE</name>
				  <description>Wakeup timer enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ALRBE</name>
				  <description>Alarm B enable</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>ALRAE</name>
				  <description>Alarm A enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>SSRUIE</name>
				  <description>SSR underflow interrupt enable</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>FMT</name>
				  <description>Hour format</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>BYPSHAD</name>
				  <description>Bypass the shadow               registers</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>REFCKON</name>
				  <description>RTC_REFIN reference clock detection               enable (50 or 60 Hz)</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TSEDGE</name>
				  <description>Timestamp event active               edge</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>WUCKSEL</name>
				  <description>Wakeup clock selection</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>WPR</name>
			  <displayName>WPR</displayName>
			  <description>write protection register</description>
			  <addressOffset>0x24</addressOffset>
			  <size>0x20</size>
			  <access>write-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>KEY</name>
				  <description>Write protection key</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>8</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>CALR</name>
			  <displayName>CALR</displayName>
			  <description>CALR</description>
			  <addressOffset>0x28</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>CALP</name>
				  <description>Use an 8-second calibration cycle               period</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CALW8</name>
				  <description>Use a 16-second calibration cycle               period</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CALW16</name>
				  <description>CALW16</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>LPCAL</name>
				  <description>Calibration low-power mode</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CALM</name>
				  <description>Calibration minus</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>9</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>SHIFTR</name>
			  <displayName>SHIFTR</displayName>
			  <description>SHIFTR</description>
			  <addressOffset>0x2C</addressOffset>
			  <size>0x20</size>
			  <access>write-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>ADD1S</name>
				  <description>Add one second</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>SUBFS</name>
				  <description>Subtract a fraction of a               second</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TSTR</name>
			  <displayName>TSTR</displayName>
			  <description>TSTR</description>
			  <addressOffset>0x30</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format.</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format.</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format.</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD               format.</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format.</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD               format.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TSDR</name>
			  <displayName>TSDR</displayName>
			  <description>TSDR</description>
			  <addressOffset>0x34</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>WDU</name>
				  <description>Week day units</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MT</name>
				  <description>Month tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MU</name>
				  <description>Month units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>DU</name>
				  <description>Date units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TSSSR</name>
			  <displayName>TSSSR</displayName>
			  <description>TSSSR</description>
			  <addressOffset>0x38</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Sub second value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ALRMAR</name>
			  <displayName>ALRMAR</displayName>
			  <description>ALRMAR</description>
			  <addressOffset>0x40</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>MSK4</name>
				  <description>Alarm A date mask</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>WDSEL</name>
				  <description>Week day selection</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>DU</name>
				  <description>Date units or day in BCD               format</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MSK3</name>
				  <description>Alarm A hours mask</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MSK2</name>
				  <description>Alarm A minutes mask</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MSK1</name>
				  <description>Alarm A seconds mask</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format.</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD               format.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ALRMASSR</name>
			  <displayName>ALRMASSR</displayName>
			  <description>ALRMASSR</description>
			  <addressOffset>0x44</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSCLR</name>
				  <description>Clear synchronous counter on alarm (Binary mode only)</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MASKSS</name>
				  <description>Mask the most-significant bits starting               at this bit</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>6</bitWidth>
				</field>
				<field>
				  <name>SS</name>
				  <description>Sub seconds value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				</field>
			  </fields>
			</register>
