cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SPI1">
         <name>SPI2</name>
         <baseAddress>0x40003800</baseAddress>
         <interrupt>
            <name>SPI2S2</name>
            <description>SPI2S2 global interrupt</description>
            <value>35</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SPI1">
         <name>SPI3</name>
         <baseAddress>0x58010000</baseAddress>        
      </peripheral>	  
      <peripheral>
         <name>STK</name>
         <description>SysTick timer</description>
         <groupName>STK</groupName>
         <baseAddress>0xE000E010</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x11</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <displayName>CTRL</displayName>
               <description>SysTick control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>SysTick exception request               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>Clock source selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>COUNTFLAG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOAD</name>
               <displayName>LOAD</displayName>
               <description>SysTick reload value register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VAL</name>
               <displayName>VAL</displayName>
               <description>SysTick current value register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <displayName>CALIB</displayName>
               <description>SysTick calibration value           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>SKEW flag: Indicates whether the TENMS               value is exact</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>NOREF flag. Reads as zero</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>    	  
      <peripheral>
         <name>SYSCFG</name>
         <description>System configuration controller</description>
         <groupName>SYSCFG</groupName>
         <baseAddress>0x40010000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MEMRMP</name>
               <displayName>MEMRMP</displayName>
               <description>memory remap register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEM_MODE</name>
                     <description>Memory mapping selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR1</name>
               <displayName>CFGR1</displayName>
               <description>configuration register 1</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7C000001</resetValue>
               <fields>
                  <field>
                     <name>I2C3_FMP</name>
                     <description>I2C3 Fast-mode Plus driving capability               activation</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2_FMP</name>
                     <description>I2C2 Fast-mode Plus driving capability               activation</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1_FMP</name>
                     <description>I2C1 Fast-mode Plus driving capability               activation</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB9_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB9</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB8_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB8</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB7_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB7</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB6_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOSTEN</name>
                     <description>I/O analog switch voltage booster               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR1</name>
               <displayName>EXTICR1</displayName>
               <description>external interrupt configuration register           1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI3</name>
                     <description>EXTI 3 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI2</name>
                     <description>EXTI 2 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI1</name>
                     <description>EXTI 1 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI0</name>
                     <description>EXTI 0 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR2</name>
               <displayName>EXTICR2</displayName>
               <description>external interrupt configuration register           2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI7</name>
                     <description>EXTI 7 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI6</name>
                     <description>EXTI 6 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI5</name>
                     <description>EXTI 5 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI4</name>
                     <description>EXTI 4 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR3</name>
               <displayName>EXTICR3</displayName>
               <description>external interrupt configuration register           3</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI11</name>
                     <description>EXTI 11 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI10</name>
                     <description>EXTI 10 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI9</name>
                     <description>EXTI 9 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI8</name>
                     <description>EXTI 8 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR4</name>
               <displayName>EXTICR4</displayName>
               <description>external interrupt configuration register           4</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI15</name>
                     <description>EXTI15 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI14</name>
                     <description>EXTI14 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI13</name>
                     <description>EXTI13 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXTI12</name>
                     <description>EXTI12 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCSR</name>
               <displayName>SCSR</displayName>
               <description>SCSR</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
			      <field>
                     <name>PKASRAMBSY</name>
                     <description>PKA SRAM busy by erase operation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRAMBSY</name>
                     <description>SRAM1, SRAM2 and PKA SRAM busy by erase               operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRAM2ER</name>
                     <description>SRAM2 erase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>CFGR2</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPF</name>
                     <description>SRAM2 parity error flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ECCL</name>
                     <description>ECC Lock</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PVDL</name>
                     <description>PVD lock enable bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPL</name>
                     <description>SRAM2 parity lock bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CLL</name>
                     <description>CPU1 LOCKUP (Hardfault) output enable               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
