cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
            <register>
               <name>BDTR</name>
               <displayName>BDTR</displayName>
               <description>break and dead-time register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BK2BID</name>
                     <description>Break2 bidirectional</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKBID</name>
                     <description>BKBID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2DSRM</name>
                     <description>Break2 Disarm</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKDSRM</name>
                     <description>BKDSRM</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2P</name>
                     <description>Break 2 polarity</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2E</name>
                     <description>Break 2 enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2F</name>
                     <description>Break 2 filter</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BKF</name>
                     <description>Break filter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MOE</name>
                     <description>Main output enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AOE</name>
                     <description>Automatic output enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKP</name>
                     <description>Break polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKE</name>
                     <description>Break enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSR</name>
                     <description>Off-state selection for Run               mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSI</name>
                     <description>Off-state selection for Idle               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DT</name>
                     <description>Dead-time generator setup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>DMA control register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>DMA address for full transfer</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OR1</name>
               <displayName>OR1</displayName>
               <description>option register 1</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TI1_RMP</name>
                     <description>Input Capture 1 remap</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1_ETR_ADC1_RMP</name>
                     <description>TIM1_ETR_ADC1 remapping               capability</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR3OutputComparemode</name>
               <displayName>CCMR3OutputComparemode</displayName>
               <description>capture/compare mode register           3</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>OC6M_3</name>
                     <description>OC6M</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC5M_3</name>
                     <description>OC5M</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC6CE</name>
                     <description>OC6CE</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC6M</name>
                     <description>OC6M</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC6PE</name>
                     <description>OC6PE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC6FE</name>
                     <description>OC6FE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC5CE</name>
                     <description>OC5CE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC5M</name>
                     <description>OC5M</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC5PE</name>
                     <description>OC5PE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC5FE</name>
                     <description>OC5FE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR5</name>
               <displayName>CCR5</displayName>
               <description>capture/compare register 5</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GC5C3</name>
                     <description>Group Channel 5 and Channel               3</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GC5C2</name>
                     <description>Group Channel 5 and Channel               2</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GC5C1</name>
                     <description>Group Channel 5 and Channel               1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCR5</name>
                     <description>Capture/Compare 5 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR6</name>
               <displayName>CCR6</displayName>
               <description>capture/compare register 6</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR6</name>
                     <description>Capture/Compare 6 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>alternate function option register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ResETRSEL</name>
                     <description>ETR source selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP2P</name>
                     <description>BRK COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP1P</name>
                     <description>BRK COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINP</name>
                     <description>BRK BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP2E</name>
                     <description>BRK COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP1E</name>
                     <description>BRK COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AF2</name>
               <displayName>AF2</displayName>
               <description>Alternate function register 2</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>BK2CMP2P</name>
                     <description>BRK2 COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP1P</name>
                     <description>BRK2 COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2INP</name>
                     <description>BRK2 BKIN2 input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP2E</name>
                     <description>BRK2 COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP1E</name>
                     <description>BRK2 COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2INE</name>
                     <description>BRK2 BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TISEL</name>
               <displayName>TISEL</displayName>
               <description>timer input selection register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TI4SEL</name>
                     <description>selects TI4[0] to TI4[15]               input</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TI3SEL</name>
                     <description>selects TI3[0] to TI3[15]               input</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TI2SEL</name>
                     <description>selects TI2[0] to TI2[15]               input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TI1SEL</name>
                     <description>selects TI1[0] to TI1[15]               input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
