cmsis-svd/cmsis-svd/data/STMicro/STM32WLEx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TIM16</name>
         <description>General-purpose timers</description>
         <groupName>GPTIM</groupName>
         <baseAddress>0x40014400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TIM16</name>
            <description>Timer 16 global interrupt</description>
            <value>28</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>TIM16/TIM17 control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>UIFREMAP</name>
                     <description>UIF status bit remapping</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKD</name>
                     <description>Clock division</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ARPE</name>
                     <description>Auto-reload preload enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPM</name>
                     <description>One pulse mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URS</name>
                     <description>Update request source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDIS</name>
                     <description>Update disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEN</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>TIM16/TIM17 control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>OIS1N</name>
                     <description>OIS1N</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIS1</name>
                     <description>OIS1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCDS</name>
                     <description>CCDS</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCUS</name>
                     <description>CCUS</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCPC</name>
                     <description>CCPC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIER</name>
               <displayName>DIER</displayName>
               <description>TIM16/TIM17 DMA/interrupt enable           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>COMDE</name>
                     <description>COM DMA request enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1DE</name>
                     <description>Capture/Compare 1 DMA request               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDE</name>
                     <description>Update DMA request enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIE</name>
                     <description>Break interrupt enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMIE</name>
                     <description>COM interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1IE</name>
                     <description>Capture/Compare 1 interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIE</name>
                     <description>Update interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>TIM16/TIM17 status register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CC1OF</name>
                     <description>Capture/Compare 1 overcapture               flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIF</name>
                     <description>Break interrupt flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMIF</name>
                     <description>COM interrupt flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1IF</name>
                     <description>Capture/Compare 1 interrupt               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIF</name>
                     <description>Update interrupt flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EGR</name>
               <displayName>EGR</displayName>
               <description>TIM16/TIM17 event generation           register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>BG</name>
                     <description>Break generation</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMG</name>
                     <description>Capture/Compare control update               generation</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1G</name>
                     <description>Capture/Compare 1               generation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UG</name>
                     <description>Update generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR1_Output</name>
               <displayName>CCMR1_Output</displayName>
               <description>TIM16/TIM17 capture/compare mode register           1</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>OC1M_3</name>
                     <description>OC1M</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC1M</name>
                     <description>OC1M</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC1PE</name>
                     <description>OC1PE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC1FE</name>
                     <description>OC1FE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1S</name>
                     <description>CC1S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR1_Input</name>
               <displayName>CCMR1_Input</displayName>
               <description>TIM16/TIM17 capture/compare mode register           1</description>
               <alternateRegister>CCMR1_Output</alternateRegister>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>IC1F</name>
                     <description>IC1F</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IC1PSC</name>
                     <description>IC1PSC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CC1S</name>
                     <description>CC1S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCER</name>
               <displayName>CCER</displayName>
               <description>TIM16/TIM17 capture/compare enable           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CC1NP</name>
                     <description>Capture/Compare 1 complementary output               polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1NE</name>
                     <description>Capture/Compare 1 complementary output               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1P</name>
                     <description>Capture/Compare 1 output               polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1E</name>
                     <description>Capture/Compare 1 output               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <displayName>CNT</displayName>
               <description>TIM16/TIM17 counter</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UIFCPYorRes</name>
                     <description>UIF Copy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSC</name>
               <displayName>PSC</displayName>
               <description>TIM16/TIM17 prescaler</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PSC</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARR</name>
               <displayName>ARR</displayName>
               <description>TIM16/TIM17 auto-reload           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>ARR</name>
                     <description>Auto-reload value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <displayName>RCR</displayName>
               <description>TIM16/TIM17 repetition counter           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>REP</name>
                     <description>Repetition counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR1</name>
               <displayName>CCR1</displayName>
               <description>TIM16/TIM17 capture/compare register           1</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR1</name>
                     <description>Capture/Compare 1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTR</name>
               <displayName>BDTR</displayName>
               <description>TIM16/TIM17 break and dead-time           register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKBID</name>
                     <description>Break Bidirectional</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKDSRM</name>
                     <description>Break Disarm</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKF</name>
                     <description>Break filter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MOE</name>
                     <description>Main output enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AOE</name>
                     <description>Automatic output enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKP</name>
                     <description>Break polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKE</name>
                     <description>Break enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSR</name>
                     <description>Off-state selection for Run               mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSI</name>
                     <description>Off-state selection for Idle               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DT</name>
                     <description>Dead-time generator setup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>TIM16/TIM17 DMA control           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>TIM16/TIM17 DMA address for full           transfer</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
